RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Include/gd32h77x_78x_tli.h
/*!
    \file    gd32h77x_78x_tli.h
    \brief   definitions for the TLI

    \version 2026-06-18, V0.5.0, firmware for GD32H77x_78x
*/

/*
    Copyright (c) 2026, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification, 
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this 
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice, 
       this list of conditions and the following disclaimer in the documentation 
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors 
       may be used to endorse or promote products derived from this software without 
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" 
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED 
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. 
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, 
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT 
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR 
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, 
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) 
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY 
OF SUCH DAMAGE.
*/

#ifndef GD32H77X_78X_TLI_H
#define GD32H77X_78X_TLI_H

#include "gd32h77x_78x.h"

/* TLI definitions */
#define TLI                               TLI_BASE                          /*!< TLI base address */
/* TLI layer definitions */
#define LAYER0                            (TLI_BASE + 0x00000084U)          /*!< TLI layer0 base address */
#define LAYER1                            (TLI_BASE + 0x00000104U)          /*!< TLI layer1 base address */

/* registers definitions */
#define TLI_SPSZ                          REG32(TLI + 0x00000008U)          /*!< TLI synchronous pulse size register */
#define TLI_BPSZ                          REG32(TLI + 0x0000000CU)          /*!< TLI back-porch size register */
#define TLI_ASZ                           REG32(TLI + 0x00000010U)          /*!< TLI active size register */
#define TLI_TSZ                           REG32(TLI + 0x00000014U)          /*!< TLI total size register */
#define TLI_CTL                           REG32(TLI + 0x00000018U)          /*!< TLI control register */
#define TLI_RL                            REG32(TLI + 0x00000024U)          /*!< TLI reload Layer register */
#define TLI_BGC                           REG32(TLI + 0x0000002CU)          /*!< TLI background color register */
#define TLI_INTEN                         REG32(TLI + 0x00000034U)          /*!< TLI interrupt enable register */
#define TLI_INTF                          REG32(TLI + 0x00000038U)          /*!< TLI interrupt flag register */
#define TLI_INTC                          REG32(TLI + 0x0000003CU)          /*!< TLI interrupt flag clear register */
#define TLI_LM                            REG32(TLI + 0x00000040U)          /*!< TLI line mark register */
#define TLI_CPPOS                         REG32(TLI + 0x00000044U)          /*!< TLI current pixel position register */
#define TLI_STAT                          REG32(TLI + 0x00000048U)          /*!< TLI status register */
#define TLI_LXCTL(layerx)                 REG32((layerx) + 0x00000000U)     /*!< TLI layer x control register */
#define TLI_LXHPOS(layerx)                REG32((layerx) + 0x00000004U)     /*!< TLI layer x horizontal position parameters register */
#define TLI_LXVPOS(layerx)                REG32((layerx) + 0x00000008U)     /*!< TLI layer x vertical position parameters register */
#define TLI_LXCKEY(layerx)                REG32((layerx) + 0x0000000CU)     /*!< TLI layer x color key register */
#define TLI_LXPPF(layerx)                 REG32((layerx) + 0x00000010U)     /*!< TLI layer x packeted pixel format register */
#define TLI_LXSA(layerx)                  REG32((layerx) + 0x00000014U)     /*!< TLI layer x specified alpha register */
#define TLI_LXDC(layerx)                  REG32((layerx) + 0x00000018U)     /*!< TLI layer x default color register */
#define TLI_LXBLEND(layerx)               REG32((layerx) + 0x0000001CU)     /*!< TLI layer x blending register */
#define TLI_LXFBADDR(layerx)              REG32((layerx) + 0x00000028U)     /*!< TLI layer x frame base address register */
#define TLI_LXFLLEN(layerx)               REG32((layerx) + 0x0000002CU)     /*!< TLI layer x frame line length register */
#define TLI_LXFTLN(layerx)                REG32((layerx) + 0x00000030U)     /*!< TLI layer x frame total line number register */
#define TLI_LXLUT(layerx)                 REG32((layerx) + 0x00000040U)     /*!< TLI layer x look up table register */

/* bits definitions */
/* TLI_SPSZ */
#define TLI_SPSZ_VPSZ                     BITS(0,11)                        /*!< size of the vertical synchronous pulse */
#define TLI_SPSZ_HPSZ                     BITS(16,27)                       /*!< size of the horizontal synchronous pulse */

/* TLI_BPSZ */
#define TLI_BPSZ_VBPSZ                    BITS(0,11)                        /*!< size of the vertical back porch plus synchronous pulse */
#define TLI_BPSZ_HBPSZ                    BITS(16,27)                       /*!< size of the horizontal back porch plus synchronous pulse */

/* TLI_ASZ */
#define TLI_ASZ_VASZ                      BITS(0,11)                        /*!< size of the vertical active area width plus back porch and synchronous pulse */
#define TLI_ASZ_HASZ                      BITS(16,27)                       /*!< size of the horizontal active area width plus back porch and synchronous pulse */

/* TLI_SPSZ */
#define TLI_TSZ_VTSZ                      BITS(0,11)                        /*!< vertical total size of the display, including active area, back porch, synchronous pulse and front porch */
#define TLI_TSZ_HTSZ                      BITS(16,27)                       /*!< horizontal total size of the display, including active area, back porch, synchronous pulse and front porch */

