RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Include/gd32h77x_78x_tli.h
/* TLI flags */
#define TLI_FLAG_VDE                   TLI_STAT_VDE                         /*!< current VDE status */
#define TLI_FLAG_HDE                   TLI_STAT_HDE                         /*!< current HDE status */
#define TLI_FLAG_VS                    TLI_STAT_VS                          /*!< current VS status of the TLI */
#define TLI_FLAG_HS                    TLI_STAT_HS                          /*!< current HS status of the TLI */
#define TLI_FLAG_LM                    BIT(0) | BIT(31)                     /*!< line mark interrupt flag */
#define TLI_FLAG_FE                    BIT(1) | BIT(31)                     /*!< FIFO error interrupt flag */
#define TLI_FLAG_TE                    BIT(2) | BIT(31)                     /*!< transaction error interrupt flag */
#define TLI_FLAG_LCR                   BIT(3) | BIT(31)                     /*!< layer configuration reloaded interrupt flag */

/* TLI interrupt enable or disable */
#define TLI_INT_LM                     BIT(0)                               /*!< line mark interrupt */
#define TLI_INT_FE                     BIT(1)                               /*!< FIFO error interrupt */
#define TLI_INT_TE                     BIT(2)                               /*!< transaction error interrupt */
#define TLI_INT_LCR                    BIT(3)                               /*!< layer configuration reloaded interrupt */

/* TLI interrupt flag */
#define TLI_INT_FLAG_LM                BIT(0)                               /*!< line mark interrupt flag */
#define TLI_INT_FLAG_FE                BIT(1)                               /*!< FIFO error interrupt flag */
#define TLI_INT_FLAG_TE                BIT(2)                               /*!< transaction error interrupt flag */
#define TLI_INT_FLAG_LCR               BIT(3)                               /*!< layer configuration reloaded interrupt flag */

/* layer reload configure */
#define TLI_FRAME_BLANK_RELOAD_EN     ((uint8_t)0x00U)                      /*!< the layer configuration will be reloaded at frame blank */
#define TLI_REQUEST_RELOAD_EN         ((uint8_t)0x01U)                      /*!< the layer configuration will be reloaded after this bit sets */

/* dither function */
#define TLI_DITHER_DISABLE            ((uint8_t)0x00U)                      /*!< dither function disable */
#define TLI_DITHER_ENABLE             ((uint8_t)0x01U)                      /*!< dither function enable */

/* horizontal pulse polarity selection */
#define TLI_HSYN_ACTIVE_LOW          ((uint32_t)0x00000000U)               /*!< horizontal synchronous pulse active low */
#define TLI_HSYN_ACTIVE_HIGH        TLI_CTL_HPPS                          /*!< horizontal synchronous pulse active high */

/* vertical pulse polarity selection */
#define TLI_VSYN_ACTIVE_LOW          ((uint32_t)0x00000000U)               /*!< vertical synchronous pulse active low */
#define TLI_VSYN_ACTIVE_HIGH        TLI_CTL_VPPS                          /*!< vertical synchronous pulse active high */

/* pixel clock polarity selection */
#define TLI_PIXEL_CLOCK_TLI           ((uint32_t)0x00000000U)               /*!< pixel clock is TLI clock */
#define TLI_PIXEL_CLOCK_INVERTEDTLI   TLI_CTL_CLKPS                         /*!< pixel clock is inverted TLI clock */

/* data enable polarity selection */
#define TLI_DE_ACTIVE_LOW            ((uint32_t)0x00000000U)               /*!< data enable active low */
#define TLI_DE_ACTIVE_HIGH          TLI_CTL_DEPS                          /*!< data enable active high */

/* alpha calculation factor 1 of blending method */
#define LXBLEND_ACF1(regval)          (BITS(8,10) & ((uint32_t)(regval) << 8U))
#define LAYER_ACF1_SA                 LXBLEND_ACF1(4)                       /*!< normalization specified alpha */
#define LAYER_ACF1_PASA               LXBLEND_ACF1(6)                       /*!< normalization pixel alpha * normalization specified alpha */

/* alpha calculation factor 2 of blending method */
#define LXBLEND_ACF2(regval)          (BITS(0,2) & ((uint32_t)(regval)))
#define LAYER_ACF2_SA                 LXBLEND_ACF2(5)                       /*!< normalization specified alpha */
#define LAYER_ACF2_PASA               LXBLEND_ACF2(7)                       /*!< normalization pixel alpha * normalization specified alpha */

/* function declarations */
/* initialization functions, TLI enable or disable, TLI reload mode configuration */
/* deinitialize TLI registers */
void tli_deinit(void);
/* initialize the parameters of TLI parameter structure with the default values, it is suggested 
  that call this function after a tli_parameter_struct structure is defined */
void tli_struct_para_init(tli_parameter_struct *tli_struct);
/* initialize TLI */
void tli_init(tli_parameter_struct *tli_struct);
/* configure TLI dither function */
void tli_dither_config(uint8_t dither_stat);
/* enable TLI */
void tli_enable(void);
/* disable TLI */
void tli_disable(void);
/* configure TLI reload mode */
void tli_reload_config(uint8_t reload_mod);

/* TLI layer configuration functions */
/* initialize the parameters of TLI layer structure with the default values, it is suggested 
  that call this function after a tli_layer_parameter_struct structure is defined */
void tli_layer_struct_para_init(tli_layer_parameter_struct *layer_struct);
/* initialize TLI layer */
void tli_layer_init(uint32_t layerx,tli_layer_parameter_struct *layer_struct);
/* reconfigure window position */
void tli_layer_window_offset_modify(uint32_t layerx,uint16_t offset_x,uint16_t offset_y);
/* initialize the parameters of TLI layer LUT structure with the default values, it is suggested 
  that call this function after a tli_layer_lut_parameter_struct structure is defined */
void tli_lut_struct_para_init(tli_layer_lut_parameter_struct *lut_struct);
/* initialize TLI layer LUT */
void tli_lut_init(uint32_t layerx,tli_layer_lut_parameter_struct *lut_struct);
/* initialize TLI layer color key */
void tli_color_key_init(uint32_t layerx,uint8_t redkey,uint8_t greenkey,uint8_t bluekey);
/* enable TLI layer */
void tli_layer_enable(uint32_t layerx);
/* disable TLI layer */
void tli_layer_disable(uint32_t layerx);
/* enable TLI layer color keying */
void tli_color_key_enable(uint32_t layerx);
/* disable TLI layer color keying */
void tli_color_key_disable(uint32_t layerx);
/* enable TLI layer LUT */
void tli_lut_enable(uint32_t layerx);
/* disable TLI layer LUT */
void tli_lut_disable(uint32_t layerx);

/* set line mark value */
void tli_line_mark_set(uint16_t line_num);
/* get current displayed position */
uint32_t tli_current_pos_get(void);

/* flag and interrupt functions */
/* enable TLI interrupt */
void tli_interrupt_enable(uint32_t int_flag);
/* disable TLI interrupt */
void tli_interrupt_disable(uint32_t int_flag);
/* get TLI interrupt flag */
FlagStatus tli_interrupt_flag_get(uint32_t int_flag);
/* clear TLI interrupt flag */
void tli_interrupt_flag_clear(uint32_t int_flag);
/* get TLI flag or state in TLI_INTF register or TLI_STAT register */
FlagStatus tli_flag_get(uint32_t flag);

#endif /* GD32H77X_78X_TLI_H */
